tests/testfiles/brugdata-only-keepalive-push.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"><SOAP:Body><d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0" modelBaseVersion="2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><exchange><deliveryBreak>true</deliveryBreak><keepAlive>true</keepAlive><requestType>subscription</requestType><supplierIdentification><country>nl</country><nationalIdentifier>NLNDW</nationalIdentifier></supplierIdentification></exchange></d2LogicalModel></SOAP:Body></SOAP:Envelope>